; domain
;; The travel domain of Lecture 10, with the methods thrown away.
;; The four actions are identical to those in travel.hddl. Only the hierarchy is gone,
;; so a classical planner has to find the sequence for itself.
(define (domain travel-classical)
  (:requirements :strips :negative-preconditions)
  (:predicates (at ?x) (airport ?a ?c) (longDistance ?x ?y) (ticket ?x ?y) (hasTaxi ?x))

  (:action getTicket
    :parameters (?x ?y ?xc ?yc)
    :precondition (and (airport ?x ?xc) (airport ?y ?yc))
    :effect (and (ticket ?x ?y)))

  (:action fly
    :parameters (?x ?y ?x1 ?y1)
    :precondition (and (airport ?x ?x1) (airport ?y ?y1) (ticket ?x ?y) (at ?x))
    :effect (and (not (at ?x)) (not (ticket ?x ?y)) (at ?y)))

  (:action getTaxi
    :parameters (?x)
    :precondition (and (at ?x))
    :effect (and (hasTaxi ?x)))

  (:action rideTaxi
    :parameters (?x ?y)
    :precondition (and (at ?x) (not (longDistance ?x ?y)) (hasTaxi ?x))
    :effect (and (not (at ?x)) (not (hasTaxi ?x)) (at ?y)))
)

; problem
;; The same journey as pb1.hddl, stated as a goal rather than as a task.
(define (problem pb1-classical)
  (:domain travel-classical)
  (:objects portoalegre saopaulo london poa gru lhr)
  (:init (at portoalegre)
         (airport poa portoalegre) (airport gru saopaulo) (airport lhr london)
         (longDistance portoalegre saopaulo)
         (longDistance portoalegre london)
         (longDistance saopaulo london))
  (:goal (at saopaulo))
)

; plan
1. (gettaxi portoalegre)
   added: (hastaxi portoalegre)
   goals met: 0 of 1
2. (ridetaxi portoalegre gru)
   deleted: (at portoalegre) (hastaxi portoalegre)
   added: (at gru)
   goals met: 0 of 1
3. (gettaxi gru)
   added: (hastaxi gru)
   goals met: 0 of 1
4. (ridetaxi gru saopaulo)
   deleted: (at gru) (hastaxi gru)
   added: (at saopaulo)
   goals met: 1 of 1
